{"27TwentySeven": ["http://twenty-seven.keenspot.com/", "Hendrix, Cobain, Joplin, Morrison: all belong to the '27 Club,' which admits only the most brilliant musicians...and kills them dead in their 27th year. Will Garland is a famous rock guitarist, secretly unable to play for months due to a neurological disorder afflicting his left hand. He's also 27! Can he make it to 28?"], "Adventurers": ["http://adventurers.keenspot.com/", "What do a sword-wielding hero, a deeply cynical mage, a complaining theif, a robot spy, a honourable ninja, an obsessed gunslinger, a useless bard, an equally useless cute thing, and a white mage have in common? They're main characters in ADVENTURERS!, for one."], "AntiheroForHire": ["http://antihero.keenspot.com/", "Insane supervillains, cryptic madmen, giant monsters, and criminals with high-tech equipment? No problem! It's all in a night's work for Shadehawk, Antihero for Hire. Works on contingency."], "BanzaiGirl": ["http://banzaigirl.keenspot.com/", "\"Banzai Girl\" Jinky Coronado is a popular schoolgirl about to have her big 18th birthday party, when her life gets turned upside-down. Her horrific nightmares literally invade our reality... and those same nightmares may be the key to saving the world!"], "Barker": ["http://barkercomic.keenspot.com/", "The story of a boy and his dog."], "Buzzboy": ["http://buzzboy.keenspot.com/", "Buzzboy is the world's coolest super sidekick, a cheeseburger-chomping, pop culture-quoting dynamo! But what happens when his mentor, Captain Ultra, and all the top adult superheroes disappear, and Buzzboy and friends are left to save a world where sidekicks rule?"], "ChoppingBlock": ["http://choppingblock.keenspot.com/", "Y'know how sometimes you hear the voice of your dead mother in your head commanding you to murder sorority girls with a chainsaw and keep their eyeballs in a big jar of formaldehyde? Don't you hate that? I mean, does she have ANY IDEA how hard it is to get your hands on THAT MUCH formaldehyde? Sheesh."], "ClichFlamb": ["http://clicheflambe.keenspot.com/", "Sometimes a word or phrase or activity becomes so irritatingly commonplace that you want pour booze on it and set it alight."], "CountYourSheep": ["http://countyoursheep.keenspot.com/", "Can't sleep? Join Katie and her mother Laurie as they count sheep. REALLY cute sheep!"], "EverythingJake": ["http://everythingjake.keenspot.com/", "Everything Jake is not just a pun, it\u0092s the story of Jake Bruno, college freshman. It\u0092s chock full of assorted funniness about life, the universe, and everything."], "FallOutToyWorks": ["http://fallouttoyworks.keenspot.com/", "The newly-produced android named Tiffany becomes the greatest passion and potential destruction of a brilliant robot-maker. Inspired by the ideas and lyrics of FALL OUT BOY."], "FriarAndBrimstone": ["http://friarandbrimstone.keenspot.com/", "\"I'm gonna summon a demon!\""], "GeneCatlow": ["http://genecatlow.keenspot.com/", "A comic that centers on a world populated by both anthropomorphic animals and humans, who have (1) gotten along none too well through the history of their world, and (2) recently had it shown to them in no uncertain terms that they share a common ancestor, responsible for all intellgent life."], "GodMode": ["http://godmode.keenspot.com/", "Once upon a time, a teenager created a popular video game cheat code website that was inexplicably bought by a billion-dollar corporation and turned into the ultimate gaming portal. Today, she's all grown up and overseeing the GOD MODE empire with an iron fist and a smoker's cough."], "GreenWake": ["http://greenwake.keenspot.com/", "In the forgotten town of Green Wake, a string of grisly mutilations leads Morley Mack on the trail of a young woman named Ariel, who is the prime suspect. But when a stranger with startling connections to Ariel arrives under mysterious circumstances, Morley unravels a dark plot..."], "HeadTrip": ["http://headtrip.keenspot.com/", "We're the good kind of crazy, we swear."], "HoaxHunters": ["http://hoaxhunters.keenspot.com/", "Cryptids. Aliens. Monsters. What if they were real? Their existence would be debunked by a reality TV show! HOAX HUNTERS is that show."], "InHere": ["http://inhere.keenspot.com/", "A woman awakens to find herself in a drab gray room, with all of her memories intact save for the one which would explain how she ended up in the drab gray room. One drab gray room leads to another on an itinerary that seems programmed to produce far more questions than answers."], "JadeWarriors": ["http://jadewarriors.keenspot.com/", "Angel Sorayama was imbued with the power of a \"Deathkiss\" as part of a cult of female assassins fostered by the Yakuza for its own ends. When she dared to escape this life, the hunter became the hunted!"], "Katrina": ["http://katrina.keenspot.com/", "Jacqueline and Henry stumble upon the truth behind the legend of Katrina, Queen of the Vampires, who has been locked inside a convent for nearly two centuries. Now she has been unleashed by the storm that bears her name."], "Landis": ["http://landis.keenspot.com/", "The fantastic adventures of an immortal warrior woman searching for the lost hammer of Thor."], "MakeshiftMiracle": ["http://makeshiftmiracle.keenspot.com/", "Colby Reynolds searches for meaning in the world around him and discovers a place where dreams can come true, if he\u0092s willing to pay the price."], "Marksmen": ["http://marksmen.keenspot.com/", "Drake McCoy, an expert marksman, defends the future city of New San Diego from the numerous threats in the wasteland outside its walls. But when a powerful army aims to steal the city's energy technology, even Drake's skills may not be enough to fend off the siege."], "MarryMe": ["http://marryme.keenspot.com/", "A romantic comedy graphic novel about a pop star, frustrated with her love life, who marries a random fan holding a \u0093MARRY ME\u0094 sign at one of her concerts."], "MedusasDaughter": ["http://medusasdaughter.keenspot.com/", "Fifteen-year-old sideshow freak Maia Volokos, born with writhing ringlets and viperous locks, seeks the dangerous truth about herself and the parents she never knew."], "MonsterMassacre": ["http://monstermassacre.keenspot.com/", "Massive monsters, bad babes, giant guns, carnasaur carnage, creepy creators... what more could you ask for?"], "Newshounds": ["http://newshounds.keenspot.com/", "KPET is the home to a woman and her fractious (not to say fractured) talking pets, who report today's news as only talking pets can. See politics intertwined with romance, sports intertwined with intrigue, and comedy intertwined with things comedy shouldn't be intertwined with."], "NoPinkPonies": ["http://nopinkponies.keenspot.com/", "Can a girl go to such extreme just so she can get close to the guy she likes? Jess is just such a girl as she opens up a comic shop and hires the guy of her dreams to work for her. Romantic comedy with a dash of whacky hijinks ensues in this comic about a girl and the what she would do for love. Sort of."], "OutThere": ["http://outthere.keenspot.com/", "A narcissistic barmaid\u0092s two-steps-forward, one-or-two-steps-backward journey to enlightenment. Not always a pretty sight. The journey, that is. She always looks fabulous."], "Porcelain": ["http://porcelain.keenspot.com/", "Follows a futuristic female protagonist who works for a shadowy organization and executes her duties in a cold and clinical manner. Things quickly change, as she begins to unravel the secrets that surround her own existence."], "QUILTBAG": ["http://quiltbag.keenspot.com/", "Two young college girls begin a journey of self-discovery on a campus that represents the whole spectrum of sexuality, and possibility."], "RedSpike": ["http://redspike.keenspot.com/", "Project Red Spike was successful in creating the ultimate super soldiers. But what happens when those soldiers stop taking orders?"], "RumbleFall": ["http://rumblefall.keenspot.com/", "A girl from our world gets transported to a world where the fate of the future is dependant on a robot fighting tournament called Rumble Fall."], "SamuraisBlood": ["http://samuraisblood.keenspot.com/", "In an era when lineage defined you, three teenagers must make their way through the world hiding their identities in order to find their destinies."], "Sharky": ["http://sharky.keenspot.com/", "For '90s kid Patrick Sharky, there's no comic book superhero cooler than the one that shares his last name: SHARKY, the ultimate tough guy. They say you should never meet your heroes... but Patrick may not have a choice in the matter!"], "Skullkickers": ["http://skullkickers.keenspot.com/", "Two hard-headed mercenaries kill monsters and cause havoc in their search for money, fame and adventure. Along the way, they\u0092ll gore goblins, smash skeletons, punch plant people and whomp werewolves."], "SomethingHappens": ["http://somethinghappens.keenspot.com/", "\"Something Happens\" is a weekly comic emphasizing surreal sketch humor, as if 'The Far Side' were filtered through 'Monty Python.' The only guarantee made is that the comic will live up to the title, especially if you squint."], "SoreThumbs": ["http://sorethumbs.keenspot.com/", "After a beautiful TV horror host's show is cancelled, she's forced to move home to Mayflower, New Jersey and interact with her family and old friends."], "Striptease": ["http://striptease.keenspot.com/", "It's not just a clever name for a webcomic.... okay, it is. Sex, betrayal, humor, adventure, and comic book pencilling!"], "Superosity": ["http://superosity.keenspot.com/", "A lovably insane man-child in a cape. A super-intelligent board-shaped creature. An angry teenager yearning for fame. A century-old turtle who is America's hottest non-white movie star. What do you get when you put them all together? SUPEROSITY! Or hilarity, possibly. One of those."], "TheFirstDaughter": ["http://thefirstdaughter.keenspot.com/", "Tasha Tasker has discovered that her dad isn't the only member of the First Family with presidential powers."], "TheLounge": ["http://thelounge.keenspot.com/", "Follow the antics of Italy Ishida and her friends as they run the comics, anime, video games, and coffee store known as The Lounge!"], "WICKEDPOWERED": ["http://wickedpowered.keenspot.com/", "Three beautiful girls from the laser-obsessed future rescue loser Wiley Schlub from his boring life!"]}